# MinimumDistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..MinimumDistance Property
DividedPath Class See Also
---
The minimum distance is used when the layout is set to 'MinimumSpacing'. When that layout rule is used the distance between points will not fall below this value. The measurement type determines how the distance is measured.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinimumDistance { get; set; }
```

Visual Basic
---
```text
Public Property MinimumDistance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinimumDistance {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The minimumDistance is too small. |

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace